app/Http/Helpers.php

    public static function cartCount($user_id=''){

        if(Auth::check()){
            if($user_id=="") $user_id=auth()->user()->id;
            return Cart::where('user_id',$user_id)->where('order_id',null)->sum('quantity');
---
select sum(`quantity`) as aggregate from `carts` where `user_id` = 1 and `order_id` is null

    public static function getAllProductFromCart($user_id=''){
        if(Auth::check()){
            if($user_id=="") $user_id=auth()->user()->id;
            return Cart::with('product','product_image')->where('user_id',$user_id)->where('order_id',null)->get();
---
select * from `carts` where `user_id` = 1 and `order_id` is null
select * from `product_images` where `product_images`.`product_id` in (46, 52)
select * from `products` where `products`.`id` in (46, 52)

    public static function totalCartPrice($user_id=''){
        if(Auth::check()){
            if($user_id=="") $user_id=auth()->user()->id;
            return Cart::where('user_id',$user_id)->where('order_id',null)->sum('amount');
---
select sum(`amount`) as aggregate from `carts` where `user_id` = 1 and `order_id` is null

    public static function wishlistCount($user_id=''){

        if(Auth::check()){
            if($user_id=="") $user_id=auth()->user()->id;
            return Wishlist::where('user_id',$user_id)->where('cart_id',null)->sum('quantity');
---
select sum(`quantity`) as aggregate from `wishlists` where `user_id` = 1 and `cart_id` is null

    public static function getAllProductFromWishlist($user_id=''){
        if(Auth::check()){
            if($user_id=="") $user_id=auth()->user()->id;
            return Wishlist::with('product')->where('user_id',$user_id)->where('cart_id',null)->get();
---
select * from `products` where `products`.`id` in (51)
select * from `wishlists` where `user_id` = 1 and `cart_id` is null

    public static function totalWishlistPrice($user_id=''){
        if(Auth::check()){
            if($user_id=="") $user_id=auth()->user()->id;
            return Wishlist::where('user_id',$user_id)->where('cart_id',null)->sum('amount');
---
select sum(`amount`) as aggregate from `wishlists` where `user_id` = 1 and `cart_id` is null