app/Http/Controllers/CartController.php

select * from `products` where `slug` = 'new-fashionable-t-shirt-for-men' limit 1
select * from `carts` where `user_id` = 1 and `order_id` is null and `product_id` = 47 limit 1
---
    public function singleAddToCart(Request $request){
        $request->validate([
            'slug'      =>  'required',
            'quant'      =>  'required',
        ]);
        // dd($request->quant[1]);


        $product = Product::where('slug', $request->slug)->first();
        if($product->stock <$request->quant[1]){
            return back()->with('error','Out of stock, You can add other products.');
        }
        if ( ($request->quant[1] < 1) || empty($product) ) {
            request()->session()->flash('error','Invalid Products');
            return back();
        }

        $already_cart = Cart::where('user_id', auth()->user()->id)->where('order_id',null)->where('product_id', $product->id)->first();

select * from `products` where `products`.`id` = 47 limit 1
insert into `carts` (`user_id`, `product_id`, `price`, `quantity`, `amount`, `updated_at`, `created_at`) values (1, 47, 969.03, '1', 999, '2024-06-01 10:12:49', '2024-06-01 10:12:49')
---
            $cart->price = ($product->price-($product->price*$product->discount)/100);
            $cart->quantity = $request->quant[1];
            $cart->amount=($product->price * $request->quant[1]);
            if ($cart->product->stock < $cart->quantity || $cart->product->stock <= 0) return back()->with('error','Stock not sufficient!.');
            // return $cart;
            $cart->save();