app/Http/Controllers/FrontendController.php

    public function home(){
        $featured=Product::where('status','active')->where('is_featured',1)->orderBy('price','DESC')->limit(2)->get();
        $posts=Post::where('status','active')->orderBy('id','DESC')->limit(3)->get();
        $banners=Banner::where('status','active')->limit(3)->orderBy('id','DESC')->with('bannerImages')->get();
        // dd($banners);
        // return $banner;
        $products=Product::where('status','active')->orderBy('id','DESC')->limit(8)->get();
        $category=Category::where('status','active')->where('is_parent',1)->orderBy('title','ASC')->get();
---
select * from `products` where `status` = 'active' and `is_featured` = 1 order by `price` desc limit 2
select * from `posts` where `status` = 'active' order by `id` desc limit 3
select * from `banner_images` where `banner_images`.`banner_id` in (15, 16, 17)
select * from `banners` where `status` = 'active' order by `id` desc limit 3
select * from `products` where `status` = 'active' order by `id` desc limit 8
select * from `categories` where `status` = 'active' and `is_parent` = 1 order by `title` asc

            $products->whereBetween('price',$price);
        }

        $recent_products=Product::where('status','active')->orderBy('id','DESC')->limit(3)->get();
---
select * from `products` where `status` = 'active' order by `id` desc limit 3

    public function productSearch(Request $request){
        $recent_products=Product::where('status','active')->orderBy('id','DESC')->limit(3)->get();
        // fix product search
        $searchTerm = ucwords($request->search);
        $products=Product::orwhere('title','LIKE BINARY','%'.$searchTerm.'%')
                    ->orwhere('slug','LIKE BINARY','%'.$searchTerm.'%')
                    ->orwhere('description','LIKE BINARY','%'.$searchTerm.'%')
                    ->orwhere('summary','LIKE BINARY','%'.$searchTerm.'%')
                    ->orwhere('price','LIKE BINARY','%'.$searchTerm.'%')
                    ->orderBy('id','DESC')
                    ->paginate('9');
---
select * from `products` where `status` = 'active' order by `id` desc limit 3
select count(*) as aggregate from `products` where `title` LIKE BINARY '%Hf G%' or `slug` LIKE BINARY '%Hf G%' or `description` LIKE BINARY '%Hf G%' or `summary` LIKE BINARY '%Hf G%' or `price` LIKE BINARY '%Hf G%'