app/Models/Product.php

select * from `products` where `status` = 'active' and `products`.`cat_id` in (1) order by `id` desc limit 8
---
    public function rel_prods(){
        return $this->hasMany('App\Models\Product','cat_id','cat_id')->where('status','active')->orderBy('id','DESC')->limit(8);

select * from `products` where `slug` = 'new-fashionable-t-shirt-for-men' limit 1
---
    public static function getProductBySlug($slug){
        return Product::with(['cat_info','rel_prods','getReview'])->where('slug',$slug)->first();